test_harness/evidence/res-db-latency-001/summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: baseline-simple.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 1 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  0m01.0s/5m0s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1 VUs  0m02.0s/5m0s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1 VUs  0m03.0s/5m0s

running (0m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1 VUs  0m04.0s/5m0s

running (0m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 1 VUs  0m05.0s/5m0s

running (0m06.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 1 VUs  0m06.0s/5m0s

running (0m07.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 1 VUs  0m07.0s/5m0s

running (0m08.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  0m08.0s/5m0s

running (0m09.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  0m09.0s/5m0s

running (0m10.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  0m10.0s/5m0s

running (0m11.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 1 VUs  0m11.0s/5m0s

running (0m12.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 1 VUs  0m12.0s/5m0s

running (0m13.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 1 VUs  0m13.0s/5m0s

running (0m13.8s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m13.8s/5m0s

running (0m13.8s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m13.8s/5m0s

running (0m13.9s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m13.9s/5m0s

running (0m13.9s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m13.9s/5m0s

running (0m13.9s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m13.9s/5m0s

running (0m13.9s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m13.9s/5m0s

running (0m14.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m14.0s/5m0s

running (0m14.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m14.0s/5m0s

running (0m14.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m14.0s/5m0s

running (0m14.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m14.0s/5m0s

running (0m15.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m15.0s/5m0s

running (0m16.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m16.0s/5m0s

running (0m17.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1 VUs  0m17.0s/5m0s

running (0m18.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1 VUs  0m18.0s/5m0s

running (0m19.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1 VUs  0m19.0s/5m0s

running (0m20.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  0m20.0s/5m0s

running (0m21.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  0m21.0s/5m0s

running (0m22.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  0m22.0s/5m0s

running (0m23.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [   8% ] 1 VUs  0m23.0s/5m0s

running (0m24.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 1 VUs  0m24.0s/5m0s

running (0m25.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 1 VUs  0m25.0s/5m0s

running (0m26.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [   9% ] 1 VUs  0m26.0s/5m0s

running (0m27.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [   9% ] 1 VUs  0m27.0s/5m0s

running (0m28.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [   9% ] 1 VUs  0m28.0s/5m0s

running (0m29.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  0m29.0s/5m0s

running (0m30.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  0m30.0s/5m0s

running (0m31.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  0m31.0s/5m0s

running (0m32.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  11% ] 1 VUs  0m32.0s/5m0s

running (0m33.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  11% ] 1 VUs  0m33.0s/5m0s

running (0m34.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [  11% ] 1 VUs  0m34.0s/5m0s

running (0m35.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  12% ] 1 VUs  0m35.0s/5m0s

running (0m36.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  12% ] 1 VUs  0m36.0s/5m0s

running (0m37.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  12% ] 1 VUs  0m37.0s/5m0s

running (0m38.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  0m38.0s/5m0s

running (0m39.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  0m39.0s/5m0s

running (0m40.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  0m40.0s/5m0s

running (0m41.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  14% ] 1 VUs  0m41.0s/5m0s

running (0m42.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
default   [  14% ] 1 VUs  0m42.0s/5m0s

running (0m43.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
default   [  14% ] 1 VUs  0m43.0s/5m0s

running (0m44.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
default   [  15% ] 1 VUs  0m44.0s/5m0s

running (0m45.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
default   [  15% ] 1 VUs  0m45.0s/5m0s

running (0m46.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  15% ] 1 VUs  0m46.0s/5m0s

running (0m47.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
default   [  16% ] 1 VUs  0m47.0s/5m0s

running (0m48.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
default   [  16% ] 1 VUs  0m48.0s/5m0s

running (0m49.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
default   [  16% ] 1 VUs  0m49.0s/5m0s

running (0m50.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  0m50.0s/5m0s

running (0m51.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  0m51.0s/5m0s

running (0m52.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  0m52.0s/5m0s

running (0m53.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
default   [  18% ] 1 VUs  0m53.0s/5m0s

running (0m54.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
default   [  18% ] 1 VUs  0m54.0s/5m0s

running (0m55.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
default   [  18% ] 1 VUs  0m55.0s/5m0s

running (0m56.0s), 1/1 VUs, 30 complete and 0 interrupted iterations
default   [  19% ] 1 VUs  0m56.0s/5m0s

running (0m57.0s), 1/1 VUs, 31 complete and 0 interrupted iterations
default   [  19% ] 1 VUs  0m57.0s/5m0s

running (0m58.0s), 1/1 VUs, 32 complete and 0 interrupted iterations
default   [  19% ] 1 VUs  0m58.0s/5m0s

running (0m59.0s), 1/1 VUs, 33 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  0m59.0s/5m0s

running (1m00.0s), 1/1 VUs, 34 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  1m00.0s/5m0s

running (1m01.0s), 1/1 VUs, 34 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  1m01.0s/5m0s

running (1m02.0s), 1/1 VUs, 35 complete and 0 interrupted iterations
default   [  21% ] 1 VUs  1m02.0s/5m0s

running (1m03.0s), 1/1 VUs, 36 complete and 0 interrupted iterations
default   [  21% ] 1 VUs  1m03.0s/5m0s

running (1m04.0s), 1/1 VUs, 37 complete and 0 interrupted iterations
default   [  21% ] 1 VUs  1m04.0s/5m0s

running (1m05.0s), 1/1 VUs, 38 complete and 0 interrupted iterations
default   [  22% ] 1 VUs  1m05.0s/5m0s

running (1m06.0s), 1/1 VUs, 39 complete and 0 interrupted iterations
default   [  22% ] 1 VUs  1m06.0s/5m0s

running (1m07.0s), 1/1 VUs, 39 complete and 0 interrupted iterations
default   [  22% ] 1 VUs  1m07.0s/5m0s

running (1m08.0s), 1/1 VUs, 40 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  1m08.0s/5m0s

running (1m09.0s), 1/1 VUs, 41 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  1m09.0s/5m0s

running (1m10.0s), 1/1 VUs, 42 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  1m10.0s/5m0s

running (1m11.0s), 1/1 VUs, 43 complete and 0 interrupted iterations
default   [  24% ] 1 VUs  1m11.0s/5m0s

running (1m12.0s), 1/1 VUs, 44 complete and 0 interrupted iterations
default   [  24% ] 1 VUs  1m12.0s/5m0s

running (1m13.0s), 1/1 VUs, 45 complete and 0 interrupted iterations
default   [  24% ] 1 VUs  1m13.0s/5m0s

running (1m14.0s), 1/1 VUs, 45 complete and 0 interrupted iterations
default   [  25% ] 1 VUs  1m14.0s/5m0s

running (1m15.0s), 1/1 VUs, 46 complete and 0 interrupted iterations
default   [  25% ] 1 VUs  1m15.0s/5m0s

running (1m16.0s), 1/1 VUs, 47 complete and 0 interrupted iterations
default   [  25% ] 1 VUs  1m16.0s/5m0s

running (1m17.0s), 1/1 VUs, 48 complete and 0 interrupted iterations
default   [  26% ] 1 VUs  1m17.0s/5m0s

running (1m18.0s), 1/1 VUs, 49 complete and 0 interrupted iterations
default   [  26% ] 1 VUs  1m18.0s/5m0s

running (1m19.0s), 1/1 VUs, 50 complete and 0 interrupted iterations
default   [  26% ] 1 VUs  1m19.0s/5m0s

running (1m20.0s), 1/1 VUs, 51 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  1m20.0s/5m0s

running (1m21.0s), 1/1 VUs, 52 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  1m21.0s/5m0s

running (1m22.0s), 1/1 VUs, 52 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  1m22.0s/5m0s

running (1m23.0s), 1/1 VUs, 53 complete and 0 interrupted iterations
default   [  28% ] 1 VUs  1m23.0s/5m0s

running (1m24.0s), 1/1 VUs, 54 complete and 0 interrupted iterations
default   [  28% ] 1 VUs  1m24.0s/5m0s

running (1m25.0s), 1/1 VUs, 55 complete and 0 interrupted iterations
default   [  28% ] 1 VUs  1m25.0s/5m0s

running (1m26.0s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  29% ] 1 VUs  1m26.0s/5m0s

running (1m27.0s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  29% ] 1 VUs  1m27.0s/5m0s

running (1m27.3s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  29% ] 1 VUs  1m27.3s/5m0s

running (1m27.5s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  29% ] 1 VUs  1m27.5s/5m0s

running (1m28.0s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  29% ] 1 VUs  1m28.0s/5m0s

running (1m29.0s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  1m29.0s/5m0s

running (1m30.0s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  1m30.0s/5m0s

running (1m31.0s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  1m31.0s/5m0s

running (1m32.0s), 1/1 VUs, 56 complete and 0 interrupted iterations
default   [  31% ] 1 VUs  1m32.0s/5m0s

running (1m33.0s), 1/1 VUs, 57 complete and 0 interrupted iterations
default   [  31% ] 1 VUs  1m33.0s/5m0s

running (1m34.0s), 1/1 VUs, 57 complete and 0 interrupted iterations
default   [  31% ] 1 VUs  1m34.0s/5m0s

running (1m35.0s), 1/1 VUs, 57 complete and 0 interrupted iterations
default   [  32% ] 1 VUs  1m35.0s/5m0s

running (1m36.0s), 1/1 VUs, 57 complete and 0 interrupted iterations
default   [  32% ] 1 VUs  1m36.0s/5m0s

running (1m37.0s), 1/1 VUs, 57 complete and 0 interrupted iterations
default   [  32% ] 1 VUs  1m37.0s/5m0s

running (1m38.0s), 1/1 VUs, 58 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  1m38.0s/5m0s

running (1m39.0s), 1/1 VUs, 58 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  1m39.0s/5m0s

running (1m40.0s), 1/1 VUs, 59 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  1m40.0s/5m0s

running (1m41.0s), 1/1 VUs, 59 complete and 0 interrupted iterations
default   [  34% ] 1 VUs  1m41.0s/5m0s

running (1m42.0s), 1/1 VUs, 59 complete and 0 interrupted iterations
default   [  34% ] 1 VUs  1m42.0s/5m0s

running (1m43.0s), 1/1 VUs, 59 complete and 0 interrupted iterations
default   [  34% ] 1 VUs  1m43.0s/5m0s

running (1m44.0s), 1/1 VUs, 59 complete and 0 interrupted iterations
default   [  35% ] 1 VUs  1m44.0s/5m0s

running (1m45.0s), 1/1 VUs, 60 complete and 0 interrupted iterations
default   [  35% ] 1 VUs  1m45.0s/5m0s

running (1m46.0s), 1/1 VUs, 60 complete and 0 interrupted iterations
default   [  35% ] 1 VUs  1m46.0s/5m0s

running (1m47.0s), 1/1 VUs, 60 complete and 0 interrupted iterations
default   [  36% ] 1 VUs  1m47.0s/5m0s

running (1m48.0s), 1/1 VUs, 60 complete and 0 interrupted iterations
default   [  36% ] 1 VUs  1m48.0s/5m0s

running (1m49.0s), 1/1 VUs, 60 complete and 0 interrupted iterations
default   [  36% ] 1 VUs  1m49.0s/5m0s

running (1m50.0s), 1/1 VUs, 61 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  1m50.0s/5m0s

running (1m51.0s), 1/1 VUs, 62 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  1m51.0s/5m0s

running (1m52.0s), 1/1 VUs, 62 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  1m52.0s/5m0s

running (1m53.0s), 1/1 VUs, 62 complete and 0 interrupted iterations
default   [  38% ] 1 VUs  1m53.0s/5m0s

running (1m54.0s), 1/1 VUs, 62 complete and 0 interrupted iterations
default   [  38% ] 1 VUs  1m54.0s/5m0s

running (1m55.0s), 1/1 VUs, 62 complete and 0 interrupted iterations
default   [  38% ] 1 VUs  1m55.0s/5m0s

running (1m56.0s), 1/1 VUs, 62 complete and 0 interrupted iterations
default   [  39% ] 1 VUs  1m56.0s/5m0s

running (1m57.0s), 1/1 VUs, 63 complete and 0 interrupted iterations
default   [  39% ] 1 VUs  1m57.0s/5m0s

running (1m58.0s), 1/1 VUs, 63 complete and 0 interrupted iterations
default   [  39% ] 1 VUs  1m58.0s/5m0s

running (1m59.0s), 1/1 VUs, 63 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  1m59.0s/5m0s

running (2m00.0s), 1/1 VUs, 63 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  2m00.0s/5m0s

running (2m01.0s), 1/1 VUs, 63 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  2m01.0s/5m0s

running (2m02.0s), 1/1 VUs, 64 complete and 0 interrupted iterations
default   [  41% ] 1 VUs  2m02.0s/5m0s

running (2m03.0s), 1/1 VUs, 64 complete and 0 interrupted iterations
default   [  41% ] 1 VUs  2m03.0s/5m0s

running (2m04.0s), 1/1 VUs, 64 complete and 0 interrupted iterations
default   [  41% ] 1 VUs  2m04.0s/5m0s

running (2m05.0s), 1/1 VUs, 64 complete and 0 interrupted iterations
default   [  42% ] 1 VUs  2m05.0s/5m0s

running (2m06.0s), 1/1 VUs, 64 complete and 0 interrupted iterations
default   [  42% ] 1 VUs  2m06.0s/5m0s

running (2m07.0s), 1/1 VUs, 65 complete and 0 interrupted iterations
default   [  42% ] 1 VUs  2m07.0s/5m0s

running (2m08.0s), 1/1 VUs, 65 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  2m08.0s/5m0s

running (2m09.0s), 1/1 VUs, 65 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  2m09.0s/5m0s

running (2m10.0s), 1/1 VUs, 65 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  2m10.0s/5m0s

running (2m11.0s), 1/1 VUs, 65 complete and 0 interrupted iterations
default   [  44% ] 1 VUs  2m11.0s/5m0s

running (2m12.0s), 1/1 VUs, 66 complete and 0 interrupted iterations
default   [  44% ] 1 VUs  2m12.0s/5m0s

running (2m13.0s), 1/1 VUs, 66 complete and 0 interrupted iterations
default   [  44% ] 1 VUs  2m13.0s/5m0s

running (2m14.0s), 1/1 VUs, 66 complete and 0 interrupted iterations
default   [  45% ] 1 VUs  2m14.0s/5m0s

running (2m15.0s), 1/1 VUs, 66 complete and 0 interrupted iterations
default   [  45% ] 1 VUs  2m15.0s/5m0s

running (2m16.0s), 1/1 VUs, 66 complete and 0 interrupted iterations
default   [  45% ] 1 VUs  2m16.0s/5m0s

running (2m17.0s), 1/1 VUs, 67 complete and 0 interrupted iterations
default   [  46% ] 1 VUs  2m17.0s/5m0s

running (2m18.0s), 1/1 VUs, 67 complete and 0 interrupted iterations
default   [  46% ] 1 VUs  2m18.0s/5m0s

running (2m19.0s), 1/1 VUs, 67 complete and 0 interrupted iterations
default   [  46% ] 1 VUs  2m19.0s/5m0s

running (2m20.0s), 1/1 VUs, 67 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  2m20.0s/5m0s

running (2m21.0s), 1/1 VUs, 67 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  2m21.0s/5m0s

running (2m22.0s), 1/1 VUs, 68 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  2m22.0s/5m0s

running (2m23.0s), 1/1 VUs, 68 complete and 0 interrupted iterations
default   [  48% ] 1 VUs  2m23.0s/5m0s

running (2m24.0s), 1/1 VUs, 68 complete and 0 interrupted iterations
default   [  48% ] 1 VUs  2m24.0s/5m0s

running (2m25.0s), 1/1 VUs, 68 complete and 0 interrupted iterations
default   [  48% ] 1 VUs  2m25.0s/5m0s

running (2m26.0s), 1/1 VUs, 68 complete and 0 interrupted iterations
default   [  49% ] 1 VUs  2m26.0s/5m0s

running (2m27.0s), 1/1 VUs, 69 complete and 0 interrupted iterations
default   [  49% ] 1 VUs  2m27.0s/5m0s

running (2m28.0s), 1/1 VUs, 69 complete and 0 interrupted iterations
default   [  49% ] 1 VUs  2m28.0s/5m0s

running (2m29.0s), 1/1 VUs, 69 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  2m29.0s/5m0s

running (2m30.0s), 1/1 VUs, 69 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  2m30.0s/5m0s

running (2m31.0s), 1/1 VUs, 69 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  2m31.0s/5m0s

running (2m32.0s), 1/1 VUs, 69 complete and 0 interrupted iterations
default   [  51% ] 1 VUs  2m32.0s/5m0s

running (2m33.0s), 1/1 VUs, 70 complete and 0 interrupted iterations
default   [  51% ] 1 VUs  2m33.0s/5m0s

running (2m34.0s), 1/1 VUs, 70 complete and 0 interrupted iterations
default   [  51% ] 1 VUs  2m34.0s/5m0s

running (2m35.0s), 1/1 VUs, 70 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  2m35.0s/5m0s

running (2m36.0s), 1/1 VUs, 70 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  2m36.0s/5m0s

running (2m37.0s), 1/1 VUs, 70 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  2m37.0s/5m0s

running (2m38.0s), 1/1 VUs, 71 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  2m38.0s/5m0s

running (2m39.0s), 1/1 VUs, 71 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  2m39.0s/5m0s

running (2m40.0s), 1/1 VUs, 71 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  2m40.0s/5m0s

running (2m41.0s), 1/1 VUs, 71 complete and 0 interrupted iterations
default   [  54% ] 1 VUs  2m41.0s/5m0s

running (2m42.0s), 1/1 VUs, 71 complete and 0 interrupted iterations
default   [  54% ] 1 VUs  2m42.0s/5m0s

running (2m43.0s), 1/1 VUs, 72 complete and 0 interrupted iterations
default   [  54% ] 1 VUs  2m43.0s/5m0s

running (2m44.0s), 1/1 VUs, 72 complete and 0 interrupted iterations
default   [  55% ] 1 VUs  2m44.0s/5m0s

running (2m45.0s), 1/1 VUs, 72 complete and 0 interrupted iterations
default   [  55% ] 1 VUs  2m45.0s/5m0s

running (2m46.0s), 1/1 VUs, 72 complete and 0 interrupted iterations
default   [  55% ] 1 VUs  2m46.0s/5m0s

running (2m47.0s), 1/1 VUs, 72 complete and 0 interrupted iterations
default   [  56% ] 1 VUs  2m47.0s/5m0s

running (2m48.0s), 1/1 VUs, 73 complete and 0 interrupted iterations
default   [  56% ] 1 VUs  2m48.0s/5m0s

running (2m49.0s), 1/1 VUs, 73 complete and 0 interrupted iterations
default   [  56% ] 1 VUs  2m49.0s/5m0s

running (2m50.0s), 1/1 VUs, 73 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  2m50.0s/5m0s

running (2m51.0s), 1/1 VUs, 73 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  2m51.0s/5m0s

running (2m52.0s), 1/1 VUs, 73 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  2m52.0s/5m0s

running (2m53.0s), 1/1 VUs, 74 complete and 0 interrupted iterations
default   [  58% ] 1 VUs  2m53.0s/5m0s

running (2m54.0s), 1/1 VUs, 74 complete and 0 interrupted iterations
default   [  58% ] 1 VUs  2m54.0s/5m0s

running (2m55.0s), 1/1 VUs, 74 complete and 0 interrupted iterations
default   [  58% ] 1 VUs  2m55.0s/5m0s

running (2m56.0s), 1/1 VUs, 74 complete and 0 interrupted iterations
default   [  59% ] 1 VUs  2m56.0s/5m0s

running (2m57.0s), 1/1 VUs, 74 complete and 0 interrupted iterations
default   [  59% ] 1 VUs  2m57.0s/5m0s

running (2m58.0s), 1/1 VUs, 74 complete and 0 interrupted iterations
default   [  59% ] 1 VUs  2m58.0s/5m0s

running (2m59.0s), 1/1 VUs, 75 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  2m59.0s/5m0s

running (3m00.0s), 1/1 VUs, 75 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  3m00.0s/5m0s

running (3m01.0s), 1/1 VUs, 75 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  3m01.0s/5m0s

running (3m02.0s), 1/1 VUs, 75 complete and 0 interrupted iterations
default   [  61% ] 1 VUs  3m02.0s/5m0s

running (3m03.0s), 1/1 VUs, 75 complete and 0 interrupted iterations
default   [  61% ] 1 VUs  3m03.0s/5m0s

running (3m04.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  61% ] 1 VUs  3m04.0s/5m0s

running (3m05.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  62% ] 1 VUs  3m05.0s/5m0s

running (3m06.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  62% ] 1 VUs  3m06.0s/5m0s

running (3m07.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  62% ] 1 VUs  3m07.0s/5m0s

running (3m08.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  3m08.0s/5m0s

running (3m09.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  3m09.0s/5m0s

running (3m10.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  3m10.0s/5m0s

running (3m11.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  64% ] 1 VUs  3m11.0s/5m0s

running (3m12.0s), 1/1 VUs, 76 complete and 0 interrupted iterations
default   [  64% ] 1 VUs  3m12.0s/5m0s

running (3m13.0s), 1/1 VUs, 77 complete and 0 interrupted iterations
default   [  64% ] 1 VUs  3m13.0s/5m0s

running (3m14.0s), 1/1 VUs, 77 complete and 0 interrupted iterations
default   [  65% ] 1 VUs  3m14.0s/5m0s

running (3m15.0s), 1/1 VUs, 77 complete and 0 interrupted iterations
default   [  65% ] 1 VUs  3m15.0s/5m0s

running (3m16.0s), 1/1 VUs, 77 complete and 0 interrupted iterations
default   [  65% ] 1 VUs  3m16.0s/5m0s

running (3m17.0s), 1/1 VUs, 77 complete and 0 interrupted iterations
default   [  66% ] 1 VUs  3m17.0s/5m0s

running (3m18.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  66% ] 1 VUs  3m18.0s/5m0s

running (3m19.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  66% ] 1 VUs  3m19.0s/5m0s

running (3m20.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  3m20.0s/5m0s

running (3m21.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  3m21.0s/5m0s

running (3m22.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  3m22.0s/5m0s

running (3m23.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  68% ] 1 VUs  3m23.0s/5m0s

running (3m24.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  68% ] 1 VUs  3m24.0s/5m0s

running (3m25.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  68% ] 1 VUs  3m25.0s/5m0s

running (3m26.0s), 1/1 VUs, 78 complete and 0 interrupted iterations
default   [  69% ] 1 VUs  3m26.0s/5m0s

running (3m27.0s), 1/1 VUs, 79 complete and 0 interrupted iterations
default   [  69% ] 1 VUs  3m27.0s/5m0s

running (3m28.0s), 1/1 VUs, 79 complete and 0 interrupted iterations
default   [  69% ] 1 VUs  3m28.0s/5m0s

running (3m29.0s), 1/1 VUs, 79 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  3m29.0s/5m0s

running (3m30.0s), 1/1 VUs, 79 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  3m30.0s/5m0s

running (3m31.0s), 1/1 VUs, 79 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  3m31.0s/5m0s

running (3m32.0s), 1/1 VUs, 80 complete and 0 interrupted iterations
default   [  71% ] 1 VUs  3m32.0s/5m0s

running (3m33.0s), 1/1 VUs, 80 complete and 0 interrupted iterations
default   [  71% ] 1 VUs  3m33.0s/5m0s

running (3m34.0s), 1/1 VUs, 80 complete and 0 interrupted iterations
default   [  71% ] 1 VUs  3m34.0s/5m0s

running (3m35.0s), 1/1 VUs, 80 complete and 0 interrupted iterations
default   [  72% ] 1 VUs  3m35.0s/5m0s

running (3m36.0s), 1/1 VUs, 80 complete and 0 interrupted iterations
default   [  72% ] 1 VUs  3m36.0s/5m0s

running (3m37.0s), 1/1 VUs, 80 complete and 0 interrupted iterations
default   [  72% ] 1 VUs  3m37.0s/5m0s

running (3m38.0s), 1/1 VUs, 81 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  3m38.0s/5m0s

running (3m39.0s), 1/1 VUs, 81 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  3m39.0s/5m0s

running (3m40.0s), 1/1 VUs, 81 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  3m40.0s/5m0s

running (3m41.0s), 1/1 VUs, 81 complete and 0 interrupted iterations
default   [  74% ] 1 VUs  3m41.0s/5m0s

running (3m42.0s), 1/1 VUs, 81 complete and 0 interrupted iterations
default   [  74% ] 1 VUs  3m42.0s/5m0s

running (3m43.0s), 1/1 VUs, 82 complete and 0 interrupted iterations
default   [  74% ] 1 VUs  3m43.0s/5m0s

running (3m44.0s), 1/1 VUs, 82 complete and 0 interrupted iterations
default   [  75% ] 1 VUs  3m44.0s/5m0s

running (3m45.0s), 1/1 VUs, 82 complete and 0 interrupted iterations
default   [  75% ] 1 VUs  3m45.0s/5m0s

running (3m46.0s), 1/1 VUs, 82 complete and 0 interrupted iterations
default   [  75% ] 1 VUs  3m46.0s/5m0s

running (3m47.0s), 1/1 VUs, 82 complete and 0 interrupted iterations
default   [  76% ] 1 VUs  3m47.0s/5m0s

running (3m48.0s), 1/1 VUs, 83 complete and 0 interrupted iterations
default   [  76% ] 1 VUs  3m48.0s/5m0s

running (3m49.0s), 1/1 VUs, 83 complete and 0 interrupted iterations
default   [  76% ] 1 VUs  3m49.0s/5m0s

running (3m50.0s), 1/1 VUs, 83 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  3m50.0s/5m0s

running (3m51.0s), 1/1 VUs, 83 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  3m51.0s/5m0s

running (3m52.0s), 1/1 VUs, 83 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  3m52.0s/5m0s

running (3m53.0s), 1/1 VUs, 84 complete and 0 interrupted iterations
default   [  78% ] 1 VUs  3m53.0s/5m0s

running (3m54.0s), 1/1 VUs, 84 complete and 0 interrupted iterations
default   [  78% ] 1 VUs  3m54.0s/5m0s

running (3m55.0s), 1/1 VUs, 84 complete and 0 interrupted iterations
default   [  78% ] 1 VUs  3m55.0s/5m0s

running (3m56.0s), 1/1 VUs, 84 complete and 0 interrupted iterations
default   [  79% ] 1 VUs  3m56.0s/5m0s

running (3m57.0s), 1/1 VUs, 84 complete and 0 interrupted iterations
default   [  79% ] 1 VUs  3m57.0s/5m0s

running (3m58.0s), 1/1 VUs, 84 complete and 0 interrupted iterations
default   [  79% ] 1 VUs  3m58.0s/5m0s

running (3m59.0s), 1/1 VUs, 85 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  3m59.0s/5m0s

running (4m00.0s), 1/1 VUs, 85 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  4m00.0s/5m0s

running (4m01.0s), 1/1 VUs, 85 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  4m01.0s/5m0s

running (4m02.0s), 1/1 VUs, 85 complete and 0 interrupted iterations
default   [  81% ] 1 VUs  4m02.0s/5m0s

running (4m03.0s), 1/1 VUs, 85 complete and 0 interrupted iterations
default   [  81% ] 1 VUs  4m03.0s/5m0s

running (4m04.0s), 1/1 VUs, 86 complete and 0 interrupted iterations
default   [  81% ] 1 VUs  4m04.0s/5m0s

running (4m05.0s), 1/1 VUs, 86 complete and 0 interrupted iterations
default   [  82% ] 1 VUs  4m05.0s/5m0s

running (4m06.0s), 1/1 VUs, 86 complete and 0 interrupted iterations
default   [  82% ] 1 VUs  4m06.0s/5m0s

running (4m07.0s), 1/1 VUs, 86 complete and 0 interrupted iterations
default   [  82% ] 1 VUs  4m07.0s/5m0s

running (4m08.0s), 1/1 VUs, 86 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  4m08.0s/5m0s

running (4m09.0s), 1/1 VUs, 87 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  4m09.0s/5m0s

running (4m10.0s), 1/1 VUs, 87 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  4m10.0s/5m0s

running (4m11.0s), 1/1 VUs, 87 complete and 0 interrupted iterations
default   [  84% ] 1 VUs  4m11.0s/5m0s

running (4m12.0s), 1/1 VUs, 87 complete and 0 interrupted iterations
default   [  84% ] 1 VUs  4m12.0s/5m0s

running (4m13.0s), 1/1 VUs, 87 complete and 0 interrupted iterations
default   [  84% ] 1 VUs  4m13.0s/5m0s

running (4m14.0s), 1/1 VUs, 88 complete and 0 interrupted iterations
default   [  85% ] 1 VUs  4m14.0s/5m0s

running (4m15.0s), 1/1 VUs, 88 complete and 0 interrupted iterations
default   [  85% ] 1 VUs  4m15.0s/5m0s

running (4m16.0s), 1/1 VUs, 88 complete and 0 interrupted iterations
default   [  85% ] 1 VUs  4m16.0s/5m0s

running (4m17.0s), 1/1 VUs, 88 complete and 0 interrupted iterations
default   [  86% ] 1 VUs  4m17.0s/5m0s

running (4m18.0s), 1/1 VUs, 88 complete and 0 interrupted iterations
default   [  86% ] 1 VUs  4m18.0s/5m0s

running (4m19.0s), 1/1 VUs, 89 complete and 0 interrupted iterations
default   [  86% ] 1 VUs  4m19.0s/5m0s

running (4m20.0s), 1/1 VUs, 89 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  4m20.0s/5m0s

running (4m21.0s), 1/1 VUs, 89 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  4m21.0s/5m0s

running (4m22.0s), 1/1 VUs, 89 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  4m22.0s/5m0s

running (4m23.0s), 1/1 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  4m23.0s/5m0s

running (4m24.0s), 1/1 VUs, 90 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  4m24.0s/5m0s

running (4m25.0s), 1/1 VUs, 90 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  4m25.0s/5m0s

running (4m26.0s), 1/1 VUs, 90 complete and 0 interrupted iterations
default   [  89% ] 1 VUs  4m26.0s/5m0s

running (4m27.0s), 1/1 VUs, 90 complete and 0 interrupted iterations
default   [  89% ] 1 VUs  4m27.0s/5m0s

running (4m28.0s), 1/1 VUs, 90 complete and 0 interrupted iterations
default   [  89% ] 1 VUs  4m28.0s/5m0s

running (4m29.0s), 1/1 VUs, 90 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  4m29.0s/5m0s

running (4m30.0s), 1/1 VUs, 91 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  4m30.0s/5m0s

running (4m31.0s), 1/1 VUs, 91 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  4m31.0s/5m0s

running (4m32.0s), 1/1 VUs, 91 complete and 0 interrupted iterations
default   [  91% ] 1 VUs  4m32.0s/5m0s

running (4m33.0s), 1/1 VUs, 91 complete and 0 interrupted iterations
default   [  91% ] 1 VUs  4m33.0s/5m0s

running (4m34.0s), 1/1 VUs, 91 complete and 0 interrupted iterations
default   [  91% ] 1 VUs  4m34.0s/5m0s

running (4m35.0s), 1/1 VUs, 92 complete and 0 interrupted iterations
default   [  92% ] 1 VUs  4m35.0s/5m0s

running (4m36.0s), 1/1 VUs, 92 complete and 0 interrupted iterations
default   [  92% ] 1 VUs  4m36.0s/5m0s

running (4m37.0s), 1/1 VUs, 92 complete and 0 interrupted iterations
default   [  92% ] 1 VUs  4m37.0s/5m0s

running (4m38.0s), 1/1 VUs, 92 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  4m38.0s/5m0s

running (4m39.0s), 1/1 VUs, 92 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  4m39.0s/5m0s

running (4m40.0s), 1/1 VUs, 93 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  4m40.0s/5m0s

running (4m41.0s), 1/1 VUs, 93 complete and 0 interrupted iterations
default   [  94% ] 1 VUs  4m41.0s/5m0s

running (4m42.0s), 1/1 VUs, 93 complete and 0 interrupted iterations
default   [  94% ] 1 VUs  4m42.0s/5m0s

running (4m43.0s), 1/1 VUs, 93 complete and 0 interrupted iterations
default   [  94% ] 1 VUs  4m43.0s/5m0s

running (4m44.0s), 1/1 VUs, 93 complete and 0 interrupted iterations
default   [  95% ] 1 VUs  4m44.0s/5m0s

running (4m45.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  95% ] 1 VUs  4m45.0s/5m0s

running (4m46.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  95% ] 1 VUs  4m46.0s/5m0s

running (4m47.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  96% ] 1 VUs  4m47.0s/5m0s

running (4m48.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  96% ] 1 VUs  4m48.0s/5m0s

running (4m49.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  96% ] 1 VUs  4m49.0s/5m0s

running (4m50.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  4m50.0s/5m0s

running (4m51.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  4m51.0s/5m0s

running (4m52.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  4m52.0s/5m0s

running (4m53.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  4m53.0s/5m0s

running (4m53.3s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  4m53.3s/5m0s

running (4m53.4s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  4m53.4s/5m0s

running (4m53.5s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  4m53.5s/5m0s

running (4m54.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  4m54.0s/5m0s

running (4m55.0s), 1/1 VUs, 95 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  4m55.0s/5m0s

running (4m56.0s), 1/1 VUs, 95 complete and 0 interrupted iterations
default   [  99% ] 1 VUs  4m56.0s/5m0s

running (4m57.0s), 1/1 VUs, 95 complete and 0 interrupted iterations
default   [  99% ] 1 VUs  4m57.0s/5m0s

running (4m58.0s), 1/1 VUs, 95 complete and 0 interrupted iterations
default   [  99% ] 1 VUs  4m58.0s/5m0s

running (4m59.0s), 1/1 VUs, 95 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  4m59.0s/5m0s

running (5m00.0s), 1/1 VUs, 96 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  5m00.0s/5m0s

running (5m01.0s), 1/1 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 1 VUs  5m0s

running (5m02.0s), 1/1 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 1 VUs  5m0s

running (5m03.0s), 1/1 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 1 VUs  5m0s

running (5m04.0s), 1/1 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 1 VUs  5m0s


  █ TOTAL RESULTS 

    checks_total.......: 99      0.325113/s
    checks_succeeded...: 100.00% 99 out of 99
    checks_failed......: 0.00%   0 out of 99

    ✓ token endpoint returned 200
    ✓ token exists
    ✓ GET /api/items returned 200
    ✓ POST /api/items returned 201

    HTTP
    http_req_duration..............: avg=1.91s min=21.26ms med=220.81ms max=8.23s  p(90)=4.22s p(95)=4.24s
      { expected_response:true }...: avg=1.91s min=21.26ms med=220.81ms max=8.23s  p(90)=4.22s p(95)=4.24s
    http_req_failed................: 0.00%  0 out of 98
    http_reqs......................: 98     0.321829/s

    EXECUTION
    iteration_duration.............: avg=3.13s min=1.02s   med=1.22s    max=21.38s p(90)=5.22s p(95)=5.69s
    iterations.....................: 97     0.318545/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 1.0 MB 3.4 kB/s
    data_sent......................: 24 kB  80 B/s



running (5m04.5s), 0/1 VUs, 97 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  5m0s